{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"output_mask_type": "raw", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "output_mask": null, "arguments": {}, "name": "merge_1", "mode_type": "raw", "output_shape_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_dim": 2183, "dropout": 0.0, "mask_zero": false, "trainable": true, "name": "embedding_1", "batch_input_shape": [null, 48], "input_dtype": "int32", "input_length": 48, "W_regularizer": null, "output_dim": 50, "init": "uniform", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.3}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_dim": 2183, "dropout": 0.0, "mask_zero": false, "trainable": true, "name": "embedding_2", "batch_input_shape": [null, 34], "input_dtype": "int32", "input_length": 34, "W_regularizer": null, "output_dim": 50, "init": "uniform", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.3}}, {"class_name": "LSTM", "config": {"input_dim": 50, "unroll": false, "U_regularizer": null, "input_length": null, "activation": "tanh", "trainable": true, "name": "lstm_1", "dropout_U": 0.0, "b_regularizer": null, "forget_bias_init": "one", "W_regularizer": null, "output_dim": 50, "stateful": false, "go_backwards": false, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "dropout_W": 0.0, "consume_less": "cpu", "inner_init": "orthogonal", "return_sequences": false}}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_1", "n": 48}}]}], "mode": "sum"}}, {"class_name": "LSTM", "config": {"input_dim": 50, "unroll": false, "U_regularizer": null, "dropout_U": 0.0, "activation": "tanh", "trainable": true, "name": "lstm_2", "stateful": false, "forget_bias_init": "one", "b_regularizer": null, "input_length": null, "W_regularizer": null, "output_dim": 50, "go_backwards": false, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "dropout_W": 0.0, "consume_less": "cpu", "inner_init": "orthogonal", "return_sequences": false}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.3}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 50, "activation": "softmax", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 4, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "name": "dense_1"}}], "keras_version": "1.2.2"}