{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode": "sum", "name": "merge_1", "concat_axis": -1, "dot_axes": -1, "mode_type": "raw", "output_mask": null, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "output_dim": 50, "input_length": 48, "trainable": true, "batch_input_shape": [null, 48], "mask_zero": false, "dropout": 0.0, "W_constraint": null, "init": "uniform", "input_dim": 2183, "name": "embedding_1", "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_1", "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "output_dim": 50, "input_length": 34, "trainable": true, "batch_input_shape": [null, 34], "mask_zero": false, "dropout": 0.0, "W_constraint": null, "init": "uniform", "input_dim": 2183, "name": "embedding_2", "input_dtype": "int32", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_2", "trainable": true}}, {"class_name": "LSTM", "config": {"forget_bias_init": "one", "consume_less": "cpu", "W_regularizer": null, "stateful": false, "trainable": true, "init": "glorot_uniform", "U_regularizer": null, "unroll": false, "output_dim": 50, "b_regularizer": null, "inner_activation": "hard_sigmoid", "input_dim": 50, "name": "lstm_1", "activation": "tanh", "return_sequences": false, "inner_init": "orthogonal", "dropout_W": 0.0, "dropout_U": 0.0, "input_length": null, "go_backwards": false}}, {"class_name": "RepeatVector", "config": {"name": "repeatvector_1", "n": 48, "trainable": true}}]}], "output_shape": null, "output_mask_type": "raw", "output_shape_type": "raw", "arguments": {}}}, {"class_name": "LSTM", "config": {"forget_bias_init": "one", "consume_less": "cpu", "input_length": null, "return_sequences": false, "trainable": true, "init": "glorot_uniform", "U_regularizer": null, "unroll": false, "output_dim": 50, "b_regularizer": null, "inner_activation": "hard_sigmoid", "input_dim": 50, "name": "lstm_2", "activation": "tanh", "stateful": false, "inner_init": "orthogonal", "dropout_W": 0.0, "dropout_U": 0.0, "W_regularizer": null, "go_backwards": false}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 4, "b_constraint": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 50, "name": "dense_1", "activation": "softmax", "bias": true, "W_regularizer": null}}], "keras_version": "1.2.2"}