{"config": [{"config": {"concat_axis": -1, "output_mask": null, "arguments": {}, "output_shape": null, "dot_axes": -1, "mode": "sum", "layers": [{"config": [{"config": {"input_dtype": "int32", "init": "uniform", "mask_zero": false, "activity_regularizer": null, "dropout": 0.0, "name": "embedding_1", "W_constraint": null, "input_dim": 2183, "trainable": true, "input_length": 48, "output_dim": 50, "W_regularizer": null, "batch_input_shape": [null, 48]}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.3}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "trainable": true, "init": "glorot_uniform", "dropout_W": 0.0, "unroll": false, "go_backwards": false, "name": "gru_1", "return_sequences": false, "consume_less": "cpu", "stateful": false, "input_dim": 50, "U_regularizer": null, "input_length": null, "output_dim": 50, "W_regularizer": null, "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "dropout_U": 0.0, "activation": "tanh"}, "class_name": "GRU"}, {"config": {"n": 48, "trainable": true, "name": "repeatvector_1"}, "class_name": "RepeatVector"}], "class_name": "Sequential"}, {"config": [{"config": {"input_dtype": "int32", "init": "uniform", "mask_zero": false, "activity_regularizer": null, "dropout": 0.0, "name": "embedding_2", "W_constraint": null, "input_dim": 2183, "trainable": true, "input_length": 34, "output_dim": 50, "W_regularizer": null, "batch_input_shape": [null, 34]}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.3}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "trainable": true, "init": "glorot_uniform", "dropout_W": 0.0, "unroll": false, "go_backwards": false, "name": "gru_2", "return_sequences": false, "consume_less": "cpu", "stateful": false, "input_dim": 50, "U_regularizer": null, "input_length": null, "output_dim": 50, "W_regularizer": null, "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "dropout_U": 0.0, "activation": "tanh"}, "class_name": "GRU"}, {"config": {"n": 48, "trainable": true, "name": "repeatvector_2"}, "class_name": "RepeatVector"}], "class_name": "Sequential"}], "mode_type": "raw", "output_mask_type": "raw", "name": "merge_1", "output_shape_type": "raw"}, "class_name": "Merge"}, {"config": {"go_backwards": false, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "dropout_W": 0.0, "unroll": false, "dropout_U": 0.0, "name": "gru_3", "return_sequences": false, "consume_less": "cpu", "stateful": false, "input_dim": 50, "U_regularizer": null, "input_length": null, "output_dim": 50, "W_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "activation": "tanh"}, "class_name": "GRU"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.3}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "bias": true, "W_constraint": null, "input_dim": 50, "output_dim": 4, "W_regularizer": null, "b_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "1.2.2", "class_name": "Sequential"}