{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"arguments": {}, "concat_axis": -1, "mode": "sum", "output_mask_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dim": 2183, "mask_zero": false, "W_constraint": null, "init": "uniform", "batch_input_shape": [null, 48], "dropout": 0.0, "output_dim": 50, "input_length": 48, "W_regularizer": null, "input_dtype": "int32", "name": "embedding_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.3}}, {"class_name": "GRU", "config": {"inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "input_dim": 50, "activation": "tanh", "init": "glorot_uniform", "W_regularizer": null, "stateful": false, "dropout_U": 0.0, "go_backwards": false, "U_regularizer": null, "dropout_W": 0.0, "output_dim": 50, "input_length": null, "b_regularizer": null, "unroll": false, "return_sequences": false, "consume_less": "cpu", "name": "gru_1", "trainable": true}}, {"class_name": "RepeatVector", "config": {"name": "repeatvector_1", "n": 48, "trainable": true}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "input_dim": 2183, "mask_zero": false, "W_constraint": null, "init": "uniform", "batch_input_shape": [null, 34], "dropout": 0.0, "output_dim": 50, "input_length": 34, "W_regularizer": null, "input_dtype": "int32", "name": "embedding_2", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.3}}, {"class_name": "GRU", "config": {"inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "input_dim": 50, "activation": "tanh", "init": "glorot_uniform", "W_regularizer": null, "stateful": false, "dropout_U": 0.0, "go_backwards": false, "U_regularizer": null, "dropout_W": 0.0, "output_dim": 50, "input_length": null, "b_regularizer": null, "unroll": false, "return_sequences": false, "consume_less": "cpu", "name": "gru_2", "trainable": true}}, {"class_name": "RepeatVector", "config": {"name": "repeatvector_2", "n": 48, "trainable": true}}]}], "output_mask": null, "output_shape": null, "mode_type": "raw", "output_shape_type": "raw", "name": "merge_1", "dot_axes": -1}}, {"class_name": "GRU", "config": {"inner_init": "orthogonal", "unroll": false, "input_dim": 50, "input_length": null, "init": "glorot_uniform", "W_regularizer": null, "stateful": false, "dropout_U": 0.0, "name": "gru_3", "U_regularizer": null, "dropout_W": 0.0, "output_dim": 50, "activation": "tanh", "b_regularizer": null, "inner_activation": "hard_sigmoid", "return_sequences": false, "consume_less": "cpu", "go_backwards": false, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias": true, "input_dim": 50, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 4, "activation": "softmax", "b_regularizer": null, "b_constraint": null, "name": "dense_1", "trainable": true}}]}