{"config": [{"config": {"arguments": {}, "mode_type": "raw", "concat_axis": -1, "name": "merge_1", "output_mask_type": "raw", "layers": [{"config": [{"config": {"init": "uniform", "input_dtype": "int32", "trainable": true, "mask_zero": false, "output_dim": 50, "activity_regularizer": null, "W_regularizer": null, "input_dim": 2100, "dropout": 0.0, "batch_input_shape": [null, 48], "name": "embedding_1", "input_length": 48, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}], "class_name": "Sequential"}, {"config": [{"config": {"init": "uniform", "input_dtype": "int32", "trainable": true, "mask_zero": false, "output_dim": 50, "activity_regularizer": null, "W_regularizer": null, "input_dim": 2100, "dropout": 0.0, "batch_input_shape": [null, 34], "name": "embedding_2", "input_length": 34, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "input_dtype": "float32", "input_length": null, "dropout_U": 0.0, "trainable": true, "activation": "tanh", "inner_activation": "hard_sigmoid", "U_regularizer": null, "W_regularizer": null, "unroll": false, "return_sequences": false, "batch_input_shape": [null, null, 50], "input_dim": 50, "name": "gru_1", "stateful": false, "b_regularizer": null, "inner_init": "orthogonal", "consume_less": "cpu", "dropout_W": 0.0, "output_dim": 50, "go_backwards": false}, "class_name": "GRU"}, {"config": {"name": "repeatvector_1", "trainable": true, "n": 48}, "class_name": "RepeatVector"}], "class_name": "Sequential"}], "output_mask": null, "mode": "sum", "dot_axes": -1, "output_shape": null, "output_shape_type": "raw"}, "class_name": "Merge"}, {"config": {"init": "glorot_uniform", "input_dtype": "float32", "dropout_U": 0.0, "trainable": true, "activation": "tanh", "inner_activation": "hard_sigmoid", "output_dim": 50, "U_regularizer": null, "W_regularizer": null, "unroll": false, "return_sequences": false, "batch_input_shape": [null, null, 50], "input_dim": 50, "name": "gru_2", "stateful": false, "b_regularizer": null, "inner_init": "orthogonal", "consume_less": "cpu", "dropout_W": 0.0, "input_length": null, "go_backwards": false}, "class_name": "GRU"}, {"config": {"init": "glorot_uniform", "input_dtype": "float32", "b_constraint": null, "trainable": true, "activation": "softmax", "output_dim": 2, "activity_regularizer": null, "W_regularizer": null, "input_dim": 50, "batch_input_shape": [null, 50], "b_regularizer": null, "name": "dense_1", "bias": true, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.2", "class_name": "Sequential"}