{"keras_version": "1.2.2", "config": [{"class_name": "Merge", "config": {"output_shape": null, "arguments": {}, "dot_axes": -1, "mode_type": "raw", "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"config": {"init": "uniform", "trainable": true, "input_length": 48, "activity_regularizer": null, "input_dtype": "int32", "W_regularizer": null, "mask_zero": false, "W_constraint": null, "name": "embedding_1", "batch_input_shape": [null, 48], "output_dim": 50, "input_dim": 2100, "dropout": 0.0}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}]}, {"class_name": "Sequential", "config": [{"config": {"init": "uniform", "trainable": true, "input_length": 34, "activity_regularizer": null, "input_dtype": "int32", "W_regularizer": null, "mask_zero": false, "W_constraint": null, "name": "embedding_2", "batch_input_shape": [null, 34], "output_dim": 50, "input_dim": 2100, "dropout": 0.0}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "dropout_W": 0.0, "trainable": true, "return_sequences": false, "input_dim": 50, "consume_less": "cpu", "unroll": false, "stateful": false, "dropout_U": 0.0, "U_regularizer": null, "go_backwards": false, "W_regularizer": null, "activation": "tanh", "input_length": null, "name": "gru_1", "b_regularizer": null, "output_dim": 50, "inner_init": "orthogonal", "batch_input_shape": [null, null, 50], "input_dtype": "float32", "inner_activation": "hard_sigmoid"}, "class_name": "GRU"}, {"config": {"n": 48, "trainable": true, "name": "repeatvector_1"}, "class_name": "RepeatVector"}]}], "output_mask": null, "mode": "sum", "output_mask_type": "raw", "output_shape_type": "raw", "concat_axis": -1}}, {"class_name": "GRU", "config": {"init": "glorot_uniform", "dropout_W": 0.0, "inner_activation": "hard_sigmoid", "trainable": true, "input_dtype": "float32", "return_sequences": false, "consume_less": "cpu", "unroll": false, "stateful": false, "U_regularizer": null, "go_backwards": false, "W_regularizer": null, "activation": "tanh", "input_length": null, "name": "gru_2", "b_regularizer": null, "output_dim": 50, "inner_init": "orthogonal", "batch_input_shape": [null, null, 50], "input_dim": 50, "dropout_U": 0.0}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "trainable": true, "b_constraint": null, "batch_input_shape": [null, 50], "activity_regularizer": null, "input_dtype": "float32", "W_regularizer": null, "activation": "softmax", "W_constraint": null, "name": "dense_1", "b_regularizer": null, "output_dim": 2, "input_dim": 50}}], "class_name": "Sequential"}